//напишите программу, которая возводит в квадрат вводимое число
Console.WriteLine("введите целое число");
int number = Convert.ToInt32(Console.ReadLine());
int square = number * number;
Console.WriteLine($"квадрат числа {number}={square}");
